sim/analysis/amr/10xbase/ngP_01_02_1_2_4/250_40_1/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicRefineFvMesh;

// How often to refine
refineInterval  1; 

// Field to be refinement on
field           normalisedGradP;

// Refine field in between lower..upper
lowerRefineLevel 0.2;
upperRefineLevel 1;

// If value < unrefineLevel unrefine
unrefineLevel   0.1;

// Have slower than 2:1 refinement
nBufferLayers   2;

// Refine cells only up to maxRefinement levels
maxRefinement   4;

// Stop refinement if maxCells reached
maxCells        1000000;

// Flux field and corresponding velocity field. Fluxes on changed
// faces get recalculated by interpolating the velocity. Use 'none'
// on surfaceScalarFields that do not need to be reinterpolated.
correctFluxes
(
    (phi none)
    (nHatf none)
    (rhoPhi none)
    (alphaPhi0.water none)
    (ghf none)
	(neg none)
	(pos none)
);

// Write the refinement level as a volScalarField
dumpLevel       true;


// ************************************************************************* //
