sim/analysis/amr/10xbase/ngP_01_02_1_2_4/250_40_1/0.orig/H2O
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      H2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	inlet
	{
	    type            fixedValue;
	    value           uniform 0;
	}
	top
	{
	    type            fixedValue;
	    value           uniform 0;
	}
	bottom
        {
            type            fixedValue;
            value           uniform 0;
        }
	outlet
	{
	    type            inletOutlet;
	    inletValue      uniform 0;
	    value           uniform 0;
	}
	frontAndBack
	{
	    type            fixedValue;
		value			uniform 0;
	}
}


// ************************************************************************* //
